==================
Root node annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then an annotation line.
## Because sometimes we want to add comments!

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (annotation_line
            (plaintext))
        (empty_line))
)

==================
Node-1 first-line annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then an annotation line.
> Pseudo-empty node
    ## Because sometimes we want to add comments!

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (node
            (node_title
                (richtext_line
                    (plaintext)))
            (node_content
                (annotation_line
                    (plaintext))))
        (empty_line))
)

==================
Node-1 second-line annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then an annotation line.
> Pseudo-empty node
    With some normal node content
    ## And then an annotation
    Followed by more normal node stuff

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (node
            (node_title
                (richtext_line
                    (plaintext)))
            (node_content
                (richtext_line
                    (plaintext))
                (annotation_line
                    (plaintext))
                (richtext_line
                    (plaintext))))
        (empty_line))
)

==================
Root in-list (UNOL-1) annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then...
++  a list
    ## with an annotation

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (unordered_list
            (unordered_list_item
                (richtext_line
                    (plaintext))
                (annotation_line
                    (plaintext))))
        (empty_line))
)

==================
Root in-list (UNOL-1) interstitial annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then...
++  a list
    ## with an annotation
    in the middle of a list item

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (unordered_list
            (unordered_list_item
                (richtext_line
                    (plaintext))
                (annotation_line
                    (plaintext))
                (richtext_line
                    (plaintext))))
        (empty_line))
)

==================
Root in-list (OL-1) annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then...
1.. a list
    ## with an annotation

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (ordered_list
            (ordered_list_item
                (ext_ol_index)
                (richtext_line
                    (plaintext))
                (annotation_line
                    (plaintext))))
        (empty_line))
)

==================
Root after-list (UNOL-1) annotation w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then...
++  a list
## with an annotation immediately following

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (unordered_list
            (unordered_list_item
                (richtext_line
                    (plaintext))))
        (annotation_line
            (plaintext))
        (empty_line))
)

==================
Node-2 annotation forcing dedent w/ trailing emptyline
==================
This is a simple cleancopy document with plain text in the root node and
then some other stuff:
> First, NODE-1
    > Then, NODE-2
        Along with some content

    ## And now an annotation forcing back out to node-1

---

(document
    (node_content
        (richtext_line
            (plaintext))
        (richtext_line
            (plaintext))
        (node
            (node_title
                (richtext_line
                    (plaintext)))
            (node_content
                (node
                    (node_title
                        (richtext_line
                            (plaintext)))
                    (node_content
                        (richtext_line
                            (plaintext))))
                (empty_line)
                (annotation_line
                    (plaintext))))
        (empty_line))
)